# IsVisible Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillSchemeEntry..::..IsVisible Property
ColorFillSchemeEntry Class See Also
---
Represents if the element colored based on this entry is visible in views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool IsVisible { get; set; }
```

Visual Basic
---
```text
Public Property IsVisible As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsVisible {
	bool get ();
	void set (bool value);
}
```

# See Also
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace